app/controllers/admin/arvores_controller.rb

  def index
    #@arvores = Arvore.order('nome').paginate :page=> params['page'], :per_page=>30
    @arvores = Arvore.all
---
SELECT `arvores`.* FROM `arvores`

  def show
    @arvore = Arvore.find(params[:id])
---
SELECT `arvores`.* FROM `arvores` WHERE `arvores`.`id` = 1 LIMIT 1

  def create
    @arvore = Arvore.new(params[:arvore])
    if @arvore.save
---
INSERT INTO `arvores` (`altura_maxima`, `altura_minima`, `copa_diametro_maximo`, `copa_diametro_minimo`, `created_at`, `dap_maximo`, `dap_minimo`, `extincao_id`, `familia_id`, `germinacao_taxa_id`, `germinacao_tempo_id`, `observacao`, `pais_id`, `sementes_kg`, `sementes_viabilidade`, `updated_at`) VALUES (2, 1, 6, 5, '2011-10-13 14:11:52', 4, 3, NULL, NULL, 1, 1, '9', NULL, 7, 8, '2011-10-13 14:11:52')