app/controllers/admin/crescimentos_controller.rb

  def index
    @crescimentos = Crescimento.order('nome')
---
SELECT `crescimentos`.* FROM `crescimentos` ORDER BY nome

  def create
    @crescimento = Crescimento.new(params[:crescimento])
    if @crescimento.save
---
INSERT INTO `crescimentos` (`created_at`, `descricao`, `nome`, `updated_at`) VALUES ('2011-10-11 16:39:26', NULL, 'Lento', '2011-10-11 16:39:26')