app/controllers/admin/familias_controller.rb

  def index
    @familias = Familia.order('nome').paginate :page=> params['page'], :per_page=>30
---
SELECT `familias`.* FROM `familias` ORDER BY nome

  def show
    @familia = Familia.find(params[:id])
---
SELECT `familias`.* FROM `familias` WHERE `familias`.`id` = 1 LIMIT 1

  def create
    @familia = Familia.new(params[:familia])
    if @familia.save
---
INSERT INTO `familias` (`nome`) VALUES ('Familia Linda')