app/controllers/admin/germinacao_taxas_controller.rb

  def index
    @germinacao_taxas = GerminacaoTaxa.order('taxa').paginate :page=> params['page'], :per_page=>30
---
SELECT `germinacao_taxas`.* FROM `germinacao_taxas` ORDER BY taxa

  def show
    @germinacao_taxa = GerminacaoTaxa.find(params[:id])
---
SELECT `germinacao_taxas`.* FROM `germinacao_taxas` WHERE `germinacao_taxas`.`id` = 1 LIMIT 1

  def edit
    @germinacao_taxa = GerminacaoTaxa.find(params[:id])
---
SELECT `germinacao_taxas`.* FROM `germinacao_taxas` WHERE `germinacao_taxas`.`id` = 1 LIMIT 1

  def create
    @germinacao_taxa = GerminacaoTaxa.new(params[:germinacao_taxa])
    if @germinacao_taxa.save
---
INSERT INTO `germinacao_taxas` (`created_at`, `descricao`, `taxa`, `updated_at`) VALUES ('2011-10-13 13:51:42', NULL, 'Rápido', '2011-10-13 13:51:42')

  def update
    @germinacao_taxa = GerminacaoTaxa.find(params[:id])
    if @germinacao_taxa.update_attributes(params[:germinacao_taxa])
---
SELECT 1 FROM `germinacao_taxas` WHERE (`germinacao_taxas`.`taxa` = BINARY 'Taxa de crescimento 1' AND `germinacao_taxas`.`id` != 1) LIMIT 1
UPDATE `germinacao_taxas` SET `taxa` = 'Taxa de crescimento 1', `updated_at` = '2011-10-13 13:53:28' WHERE `germinacao_taxas`.`id` = 1