app/controllers/admin/germinacao_tempos_controller.rb

  def index
    @germinacao_tempos = GerminacaoTempo.order('tempo').paginate :page=> params['page'], :per_page=>30
---
SELECT `germinacao_tempos`.* FROM `germinacao_tempos` ORDER BY tempo

  def show
    @germinacao_tempo = GerminacaoTempo.find(params[:id])
---
SELECT `germinacao_tempos`.* FROM `germinacao_tempos` WHERE `germinacao_tempos`.`id` = 1 LIMIT 1

  def create
    @germinacao_tempo = GerminacaoTempo.new(params[:germinacao_tempo])
    if @germinacao_tempo.save
---
INSERT INTO `germinacao_tempos` (`created_at`, `tempo`, `updated_at`) VALUES ('2011-10-13 13:53:17', 'Rapido', '2011-10-13 13:53:17')