app/controllers/arvores_controller.rb

  def index
    @arvores = Arvore.all
---
SELECT `arvores`.* FROM `arvores`