app/views/admin/arvores/_form.html.erb

    <%= f.label :familia_id %><br />
    <%= f.collection_select(:familia_id,
         Familia.order('nome'),
         :id, :nome, {:prompt => true}, :class=>"form_campos") %>
---
SELECT `familias`.* FROM `familias` ORDER BY nome

    <%= f.label :germinacao_taxa_id %><br />
    <%= f.collection_select(:germinacao_taxa_id,
         GerminacaoTaxa.order('taxa'),
         :id, :taxa, {:prompt => true}, :class=>"form_campos") %>
---
SELECT `germinacao_taxas`.* FROM `germinacao_taxas` ORDER BY taxa

    <%= f.label :germinacao_tempo_id %><br />
    <%= f.collection_select(:germinacao_tempo_id,
         GerminacaoTempo.order('tempo'),
         :id, :tempo, {:prompt => true}, :class=>"form_campos") %>
---
SELECT `germinacao_tempos`.* FROM `germinacao_tempos` ORDER BY tempo

	Popular.all.each do |popular| -%>
		check_box_tag :popular_ids, popular.id, @arvore.populares.include?(popular), :name => 'arvore[popular_ids][]' %>
---
SELECT `populares`.* FROM `populares`